tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "nicoverbruggen/cask"

brew "asdf"
brew "astro"
brew "aws-sso-cli"
brew "awscli"
brew "bash-completion"
brew "coreutils"
brew "coursier/formulas/coursier"
brew "direnv"
brew "gh"
brew "git-delta"
brew "git"
brew "gnupg"
brew "httpie"
brew "hub"
brew "openssl@3"
brew "pkg-config"
brew "poetry"
brew "pyenv"
brew "readline"
brew "sqlite"
brew "tfenv"
brew "tldr"
brew "trash"
brew "tree"
brew "vim"
brew "xz"
brew "zlib"

cask "discord"
cask "docker"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "jetbrains-toolbox"
cask "screenflow"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "zoom"

vscode "amazonwebservices.aws-toolkit-vscode"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "teabyii.ayu"
vscode "vscodevim.vim"