# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'git-delta'
brew 'vim'
brew 'coursier'

# Apps
cask 'discord'
cask 'spotify'
cask 'docker'
cask 'github'
cask 'google-chrome'
cask 'google-drive'
cask 'gpg-suite'
cask 'screenflow'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'zoom'
cask 'iterm2'
cask 'jetbrains-toolbox'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-code-new-roman-nerd-font'
